'''
    1. Intelligence(지능)
        1) 학습 능력, 추론 능력, 지각 능력, 언어 이해 능력을 통칭함
        2) 새로운 문제가 발생하면 그에 맞는 지시 제공
        3) 프로그램 : 문제를 해결할 때 따라야 하는 일들을 지시하는 것
        4) 컴퓨터가 스스로 방법을 찾아냄 : 데이터를 기반으로 스스로 학습할 수 있음
            - 알파고 : 컴퓨터에 바둑 경기의 규칙, 이전 경기의 많은 데이터를 알려줌.
                    ==> 컴퓨터가 스스로 바둑의 원리를 학습하여 바둑을 둠
        5)

    4. 회귀분석
        1) 회귀 : 어딘가로 돌아간다.
        2) 회귀 분석
            - 대표적인 지도학습 알고리즘
            - 데이터(독립변수)를 통해 종속변수 사이의 숨어 있는 관계를 추정하는 것
                - 독립변수 : 다른 변수에 영향을 받지 않는 변수
                - 종속변수 :

'''